MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K22/mcu.h
// Register: PORTD
#define PORTD PORTD
extern volatile unsigned char           PORTD               __at(0xF83);
#ifndef _LIB_BUILD
asm("PORTD equ 0F83h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD0                    :1;
        unsigned RD1                    :1;
        unsigned RD2                    :1;
        unsigned RD3                    :1;
        unsigned RD4                    :1;
        unsigned RD5                    :1;
        unsigned RD6                    :1;
        unsigned RD7                    :1;
    };
    struct {
        unsigned                        :2;
        unsigned P2B                    :1;
        unsigned P2C                    :1;
        unsigned P2D                    :1;
        unsigned P1B                    :1;
        unsigned P1C                    :1;
        unsigned P1D                    :1;
    };
    struct {
        unsigned                        :1;
        unsigned CCP4                   :1;
        unsigned                        :4;
        unsigned TX2                    :1;
        unsigned RX2                    :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_SS2                :1;
    };
    struct {
        unsigned SCK2                   :1;
        unsigned SDI2                   :1;
        unsigned                        :1;
        unsigned nSS2                   :1;
        unsigned SDO2                   :1;
        unsigned                        :1;
        unsigned CK2                    :1;
        unsigned DT2                    :1;
    };
    struct {
        unsigned SCL2                   :1;
        unsigned SDA2                   :1;
        unsigned                        :1;
        unsigned SS2                    :1;
    };
    struct {
        unsigned AN20                   :1;
        unsigned AN21                   :1;
        unsigned AN22                   :1;
        unsigned AN23                   :1;
        unsigned AN24                   :1;
        unsigned AN25                   :1;
        unsigned AN26                   :1;
        unsigned AN27                   :1;
    };
} PORTDbits_t;
extern volatile PORTDbits_t PORTDbits __at(0xF83);
// bitfield macros
#define _PORTD_RD0_POSN                                     0x0
#define _PORTD_RD0_POSITION                                 0x0
#define _PORTD_RD0_SIZE                                     0x1
#define _PORTD_RD0_LENGTH                                   0x1
#define _PORTD_RD0_MASK                                     0x1
#define _PORTD_RD1_POSN                                     0x1
#define _PORTD_RD1_POSITION                                 0x1
#define _PORTD_RD1_SIZE                                     0x1
#define _PORTD_RD1_LENGTH                                   0x1
#define _PORTD_RD1_MASK                                     0x2
#define _PORTD_RD2_POSN                                     0x2
#define _PORTD_RD2_POSITION                                 0x2
#define _PORTD_RD2_SIZE                                     0x1
#define _PORTD_RD2_LENGTH                                   0x1
#define _PORTD_RD2_MASK                                     0x4
#define _PORTD_RD3_POSN                                     0x3
#define _PORTD_RD3_POSITION                                 0x3
#define _PORTD_RD3_SIZE                                     0x1
#define _PORTD_RD3_LENGTH                                   0x1
#define _PORTD_RD3_MASK                                     0x8
#define _PORTD_RD4_POSN                                     0x4
#define _PORTD_RD4_POSITION                                 0x4
#define _PORTD_RD4_SIZE                                     0x1
#define _PORTD_RD4_LENGTH                                   0x1
#define _PORTD_RD4_MASK                                     0x10
#define _PORTD_RD5_POSN                                     0x5
#define _PORTD_RD5_POSITION                                 0x5
#define _PORTD_RD5_SIZE                                     0x1
#define _PORTD_RD5_LENGTH                                   0x1
#define _PORTD_RD5_MASK                                     0x20
#define _PORTD_RD6_POSN                                     0x6
#define _PORTD_RD6_POSITION                                 0x6
#define _PORTD_RD6_SIZE                                     0x1
#define _PORTD_RD6_LENGTH                                   0x1
#define _PORTD_RD6_MASK                                     0x40
#define _PORTD_RD7_POSN                                     0x7
#define _PORTD_RD7_POSITION                                 0x7
#define _PORTD_RD7_SIZE                                     0x1
#define _PORTD_RD7_LENGTH                                   0x1
#define _PORTD_RD7_MASK                                     0x80
#define _PORTD_P2B_POSN                                     0x2
#define _PORTD_P2B_POSITION                                 0x2
#define _PORTD_P2B_SIZE                                     0x1
#define _PORTD_P2B_LENGTH                                   0x1
#define _PORTD_P2B_MASK                                     0x4
#define _PORTD_P2C_POSN                                     0x3
#define _PORTD_P2C_POSITION                                 0x3
#define _PORTD_P2C_SIZE                                     0x1
#define _PORTD_P2C_LENGTH                                   0x1
#define _PORTD_P2C_MASK                                     0x8
#define _PORTD_P2D_POSN                                     0x4
#define _PORTD_P2D_POSITION                                 0x4
#define _PORTD_P2D_SIZE                                     0x1
#define _PORTD_P2D_LENGTH                                   0x1
#define _PORTD_P2D_MASK                                     0x10
#define _PORTD_P1B_POSN                                     0x5
#define _PORTD_P1B_POSITION                                 0x5
#define _PORTD_P1B_SIZE                                     0x1
#define _PORTD_P1B_LENGTH                                   0x1
#define _PORTD_P1B_MASK                                     0x20
#define _PORTD_P1C_POSN                                     0x6
#define _PORTD_P1C_POSITION                                 0x6
#define _PORTD_P1C_SIZE                                     0x1
#define _PORTD_P1C_LENGTH                                   0x1
#define _PORTD_P1C_MASK                                     0x40
#define _PORTD_P1D_POSN                                     0x7
#define _PORTD_P1D_POSITION                                 0x7
#define _PORTD_P1D_SIZE                                     0x1
#define _PORTD_P1D_LENGTH                                   0x1
#define _PORTD_P1D_MASK                                     0x80
#define _PORTD_CCP4_POSN                                    0x1
#define _PORTD_CCP4_POSITION                                0x1
#define _PORTD_CCP4_SIZE                                    0x1
#define _PORTD_CCP4_LENGTH                                  0x1
#define _PORTD_CCP4_MASK                                    0x2
#define _PORTD_TX2_POSN                                     0x6
#define _PORTD_TX2_POSITION                                 0x6
#define _PORTD_TX2_SIZE                                     0x1
#define _PORTD_TX2_LENGTH                                   0x1
#define _PORTD_TX2_MASK                                     0x40
#define _PORTD_RX2_POSN                                     0x7
#define _PORTD_RX2_POSITION                                 0x7
#define _PORTD_RX2_SIZE                                     0x1
#define _PORTD_RX2_LENGTH                                   0x1
#define _PORTD_RX2_MASK                                     0x80
#define _PORTD_NOT_SS2_POSN                                 0x3
#define _PORTD_NOT_SS2_POSITION                             0x3
#define _PORTD_NOT_SS2_SIZE                                 0x1
#define _PORTD_NOT_SS2_LENGTH                               0x1
#define _PORTD_NOT_SS2_MASK                                 0x8
#define _PORTD_SCK2_POSN                                    0x0
#define _PORTD_SCK2_POSITION                                0x0
#define _PORTD_SCK2_SIZE                                    0x1
#define _PORTD_SCK2_LENGTH                                  0x1
#define _PORTD_SCK2_MASK                                    0x1
#define _PORTD_SDI2_POSN                                    0x1
#define _PORTD_SDI2_POSITION                                0x1
#define _PORTD_SDI2_SIZE                                    0x1
#define _PORTD_SDI2_LENGTH                                  0x1
#define _PORTD_SDI2_MASK                                    0x2
#define _PORTD_nSS2_POSN                                    0x3
#define _PORTD_nSS2_POSITION                                0x3
#define _PORTD_nSS2_SIZE                                    0x1
#define _PORTD_nSS2_LENGTH                                  0x1
#define _PORTD_nSS2_MASK                                    0x8
#define _PORTD_SDO2_POSN                                    0x4
#define _PORTD_SDO2_POSITION                                0x4
#define _PORTD_SDO2_SIZE                                    0x1
#define _PORTD_SDO2_LENGTH                                  0x1
#define _PORTD_SDO2_MASK                                    0x10
#define _PORTD_CK2_POSN                                     0x6
#define _PORTD_CK2_POSITION                                 0x6
#define _PORTD_CK2_SIZE                                     0x1
#define _PORTD_CK2_LENGTH                                   0x1
#define _PORTD_CK2_MASK                                     0x40
#define _PORTD_DT2_POSN                                     0x7
#define _PORTD_DT2_POSITION                                 0x7
#define _PORTD_DT2_SIZE                                     0x1
#define _PORTD_DT2_LENGTH                                   0x1
#define _PORTD_DT2_MASK                                     0x80
#define _PORTD_SCL2_POSN                                    0x0
#define _PORTD_SCL2_POSITION                                0x0
#define _PORTD_SCL2_SIZE                                    0x1
#define _PORTD_SCL2_LENGTH                                  0x1
#define _PORTD_SCL2_MASK                                    0x1
#define _PORTD_SDA2_POSN                                    0x1
#define _PORTD_SDA2_POSITION                                0x1
#define _PORTD_SDA2_SIZE                                    0x1
#define _PORTD_SDA2_LENGTH                                  0x1
#define _PORTD_SDA2_MASK                                    0x2
#define _PORTD_SS2_POSN                                     0x3
#define _PORTD_SS2_POSITION                                 0x3
#define _PORTD_SS2_SIZE                                     0x1
#define _PORTD_SS2_LENGTH                                   0x1
#define _PORTD_SS2_MASK                                     0x8
#define _PORTD_AN20_POSN                                    0x0
#define _PORTD_AN20_POSITION                                0x0
#define _PORTD_AN20_SIZE                                    0x1
#define _PORTD_AN20_LENGTH                                  0x1
#define _PORTD_AN20_MASK                                    0x1
#define _PORTD_AN21_POSN                                    0x1
#define _PORTD_AN21_POSITION                                0x1
#define _PORTD_AN21_SIZE                                    0x1
#define _PORTD_AN21_LENGTH                                  0x1
#define _PORTD_AN21_MASK                                    0x2
#define _PORTD_AN22_POSN                                    0x2
#define _PORTD_AN22_POSITION                                0x2
#define _PORTD_AN22_SIZE                                    0x1
#define _PORTD_AN22_LENGTH                                  0x1
#define _PORTD_AN22_MASK                                    0x4
#define _PORTD_AN23_POSN                                    0x3
#define _PORTD_AN23_POSITION                                0x3
#define _PORTD_AN23_SIZE                                    0x1
#define _PORTD_AN23_LENGTH                                  0x1
#define _PORTD_AN23_MASK                                    0x8
#define _PORTD_AN24_POSN                                    0x4
#define _PORTD_AN24_POSITION                                0x4
#define _PORTD_AN24_SIZE                                    0x1
#define _PORTD_AN24_LENGTH                                  0x1
#define _PORTD_AN24_MASK                                    0x10
#define _PORTD_AN25_POSN                                    0x5
#define _PORTD_AN25_POSITION                                0x5
#define _PORTD_AN25_SIZE                                    0x1
#define _PORTD_AN25_LENGTH                                  0x1
#define _PORTD_AN25_MASK                                    0x20
#define _PORTD_AN26_POSN                                    0x6
#define _PORTD_AN26_POSITION                                0x6
#define _PORTD_AN26_SIZE                                    0x1
#define _PORTD_AN26_LENGTH                                  0x1
#define _PORTD_AN26_MASK                                    0x40
#define _PORTD_AN27_POSN                                    0x7
#define _PORTD_AN27_POSITION                                0x7
#define _PORTD_AN27_SIZE                                    0x1
#define _PORTD_AN27_LENGTH                                  0x1
#define _PORTD_AN27_MASK                                    0x80

// Register: PORTE
#define PORTE PORTE
extern volatile unsigned char           PORTE               __at(0xF84);
#ifndef _LIB_BUILD
asm("PORTE equ 0F84h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0                    :1;
        unsigned RE1                    :1;
        unsigned RE2                    :1;
        unsigned RE3                    :1;
    };
    struct {
        unsigned AN5                    :1;
        unsigned AN6                    :1;
        unsigned AN7                    :1;
        unsigned MCLR                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned NOT_MCLR               :1;
    };
    struct {
        unsigned P3A                    :1;
        unsigned P3B                    :1;
        unsigned CCP5                   :1;
        unsigned nMCLR                  :1;
    };
    struct {
        unsigned CCP3                   :1;
        unsigned                        :2;
        unsigned VPP                    :1;
    };
    struct {
        unsigned PD2                    :1;
        unsigned PC2                    :1;
        unsigned CCP10                  :1;
        unsigned CCP9E                  :1;
    };
    struct {
        unsigned RDE                    :1;
        unsigned WRE                    :1;
        unsigned CS                     :1;
        unsigned PC3E                   :1;
    };
    struct {
        unsigned                        :2;
        unsigned PB2                    :1;
    };
} PORTEbits_t;
