MikroElektronika/core_packages/PIC/XC8/def/PIC18LF46K22/mcu.h
#define                                 C12IN0M_bit         _BIT_ACCESS(PORTA,0)
// PORTA<C12IN0N>
extern volatile __bit                   C12IN0N             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 C12IN0N_bit         _BIT_ACCESS(PORTA,0)
// PORTA<C12IN1M>
extern volatile __bit                   C12IN1M             __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 C12IN1M_bit         _BIT_ACCESS(PORTA,1)
// PORTA<C12IN1N>
extern volatile __bit                   C12IN1N             __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 C12IN1N_bit         _BIT_ACCESS(PORTA,1)
// PORTB<C12IN2M>
extern volatile __bit                   C12IN2M             __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 C12IN2M_bit         _BIT_ACCESS(PORTB,3)
// PORTB<C12IN2N>
extern volatile __bit                   C12IN2N             __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 C12IN2N_bit         _BIT_ACCESS(PORTB,3)
// PORTB<C12IN3M>
extern volatile __bit                   C12IN3M             __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 C12IN3M_bit         _BIT_ACCESS(PORTB,1)
// PORTB<C12IN3N>
extern volatile __bit                   C12IN3N             __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 C12IN3N_bit         _BIT_ACCESS(PORTB,1)
// CM1CON0<C1CH0>
extern volatile __bit                   C1CH0               __at(0x7BC8);	// @ (0xF79 * 8 + 0)
#define                                 C1CH0_bit           _BIT_ACCESS(CM1CON0,0)
// CM1CON0<C1CH1>
extern volatile __bit                   C1CH1               __at(0x7BC9);	// @ (0xF79 * 8 + 1)
#define                                 C1CH1_bit           _BIT_ACCESS(CM1CON0,1)
// CM2CON1<C1HYS>
extern volatile __bit                   C1HYS               __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 C1HYS_bit           _BIT_ACCESS(CM2CON1,3)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,6)
// PORTA<C1INP>
extern volatile __bit                   C1INP               __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 C1INP_bit           _BIT_ACCESS(PORTA,3)
// IPR2<C1IP>
extern volatile __bit                   C1IP                __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 C1IP_bit            _BIT_ACCESS(IPR2,6)
// CM1CON0<C1OE>
extern volatile __bit                   C1OE                __at(0x7BCD);	// @ (0xF79 * 8 + 5)
#define                                 C1OE_bit            _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x7BCC);	// @ (0xF79 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1R>
extern volatile __bit                   C1R                 __at(0x7BCA);	// @ (0xF79 * 8 + 2)
#define                                 C1R_bit             _BIT_ACCESS(CM1CON0,2)
// CM2CON1<C1RSEL>
extern volatile __bit                   C1RSEL              __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 C1RSEL_bit          _BIT_ACCESS(CM2CON1,5)
// CM1CON0<C1SP>
extern volatile __bit                   C1SP                __at(0x7BCB);	// @ (0xF79 * 8 + 3)
#define                                 C1SP_bit            _BIT_ACCESS(CM1CON0,3)
// CM2CON1<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM2CON1,1)
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS0,0)
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x7A49);	// @ (0xF49 * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS0,1)
// CM2CON0<C2CH0>
extern volatile __bit                   C2CH0               __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 C2CH0_bit           _BIT_ACCESS(CM2CON0,0)
// CM2CON0<C2CH1>
extern volatile __bit                   C2CH1               __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 C2CH1_bit           _BIT_ACCESS(CM2CON0,1)
// CM2CON1<C2HYS>
extern volatile __bit                   C2HYS               __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON1,2)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x7D05);	// @ (0xFA0 * 8 + 5)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,5)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x7D0D);	// @ (0xFA1 * 8 + 5)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,5)
// PORTA<C2INP>
extern volatile __bit                   C2INP               __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 C2INP_bit           _BIT_ACCESS(PORTA,2)
// IPR2<C2IP>
extern volatile __bit                   C2IP                __at(0x7D15);	// @ (0xFA2 * 8 + 5)
#define                                 C2IP_bit            _BIT_ACCESS(IPR2,5)
// CM2CON0<C2OE>
extern volatile __bit                   C2OE                __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 C2OE_bit            _BIT_ACCESS(CM2CON0,5)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x7BC7);	// @ (0xF78 * 8 + 7)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2R>
extern volatile __bit                   C2R                 __at(0x7BC2);	// @ (0xF78 * 8 + 2)
#define                                 C2R_bit             _BIT_ACCESS(CM2CON0,2)
// CM2CON1<C2RSEL>
extern volatile __bit                   C2RSEL              __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 C2RSEL_bit          _BIT_ACCESS(CM2CON1,4)
// CM2CON0<C2SP>
extern volatile __bit                   C2SP                __at(0x7BC3);	// @ (0xF78 * 8 + 3)
#define                                 C2SP_bit            _BIT_ACCESS(CM2CON0,3)
// CM2CON1<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON1,0)
// CCPTMRS0<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x7A4B);	// @ (0xF49 * 8 + 3)
#define                                 C2TSEL0_bit         _BIT_ACCESS(CCPTMRS0,3)
// CCPTMRS0<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x7A4C);	// @ (0xF49 * 8 + 4)
#define                                 C2TSEL1_bit         _BIT_ACCESS(CCPTMRS0,4)
// CCPTMRS0<C3TSEL0>
extern volatile __bit                   C3TSEL0             __at(0x7A4E);	// @ (0xF49 * 8 + 6)
#define                                 C3TSEL0_bit         _BIT_ACCESS(CCPTMRS0,6)
// CCPTMRS0<C3TSEL1>
extern volatile __bit                   C3TSEL1             __at(0x7A4F);	// @ (0xF49 * 8 + 7)
#define                                 C3TSEL1_bit         _BIT_ACCESS(CCPTMRS0,7)
// CCPTMRS1<C4TSEL0>
extern volatile __bit                   C4TSEL0             __at(0x7A40);	// @ (0xF48 * 8 + 0)
#define                                 C4TSEL0_bit         _BIT_ACCESS(CCPTMRS1,0)
// CCPTMRS1<C4TSEL1>
extern volatile __bit                   C4TSEL1             __at(0x7A41);	// @ (0xF48 * 8 + 1)
#define                                 C4TSEL1_bit         _BIT_ACCESS(CCPTMRS1,1)
// CCPTMRS1<C5TSEL0>
extern volatile __bit                   C5TSEL0             __at(0x7A42);	// @ (0xF48 * 8 + 2)
#define                                 C5TSEL0_bit         _BIT_ACCESS(CCPTMRS1,2)
// CCPTMRS1<C5TSEL1>
extern volatile __bit                   C5TSEL1             __at(0x7A43);	// @ (0xF48 * 8 + 3)
#define                                 C5TSEL1_bit         _BIT_ACCESS(CCPTMRS1,3)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CM1CON0<CCH0>
extern volatile __bit                   CCH0                __at(0x7BC8);	// @ (0xF79 * 8 + 0)
#define                                 CCH0_bit            _BIT_ACCESS(CM1CON0,0)
// CM1CON0<CCH01>
extern volatile __bit                   CCH01               __at(0x7BC8);	// @ (0xF79 * 8 + 0)
#define                                 CCH01_bit           _BIT_ACCESS(CM1CON0,0)
// CM2CON0<CCH02>
extern volatile __bit                   CCH02               __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 CCH02_bit           _BIT_ACCESS(CM2CON0,0)
// IPR5<CCH05>
extern volatile __bit                   CCH05               __at(0x7BF8);	// @ (0xF7F * 8 + 0)
#define                                 CCH05_bit           _BIT_ACCESS(IPR5,0)
// CM1CON0<CCH1>
extern volatile __bit                   CCH1                __at(0x7BC9);	// @ (0xF79 * 8 + 1)
#define                                 CCH1_bit            _BIT_ACCESS(CM1CON0,1)
// CM1CON0<CCH11>
extern volatile __bit                   CCH11               __at(0x7BC9);	// @ (0xF79 * 8 + 1)
#define                                 CCH11_bit           _BIT_ACCESS(CM1CON0,1)
// CM2CON0<CCH12>
extern volatile __bit                   CCH12               __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 CCH12_bit           _BIT_ACCESS(CM2CON0,1)
// IPR5<CCH15>
extern volatile __bit                   CCH15               __at(0x7BF9);	// @ (0xF7F * 8 + 1)
#define                                 CCH15_bit           _BIT_ACCESS(IPR5,1)
// IPR4<CCIP3IP>
extern volatile __bit                   CCIP3IP             __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 CCIP3IP_bit         _BIT_ACCESS(IPR4,0)
// PORTC<CCP1>
extern volatile __bit                   CCP1                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CCP1_bit            _BIT_ACCESS(PORTC,2)
// PORTE<CCP10>
extern volatile __bit                   CCP10               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CCP10_bit           _BIT_ACCESS(PORTE,2)
// ECCP1AS<CCP1AS0>
extern volatile __bit                   CCP1AS0             __at(0x7DB4);	// @ (0xFB6 * 8 + 4)
#define                                 CCP1AS0_bit         _BIT_ACCESS(ECCP1AS,4)
// ECCP1AS<CCP1AS1>
extern volatile __bit                   CCP1AS1             __at(0x7DB5);	// @ (0xFB6 * 8 + 5)
#define                                 CCP1AS1_bit         _BIT_ACCESS(ECCP1AS,5)
// ECCP1AS<CCP1AS2>
extern volatile __bit                   CCP1AS2             __at(0x7DB6);	// @ (0xFB6 * 8 + 6)
#define                                 CCP1AS2_bit         _BIT_ACCESS(ECCP1AS,6)
// ECCP1AS<CCP1ASE>
extern volatile __bit                   CCP1ASE             __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 CCP1ASE_bit         _BIT_ACCESS(ECCP1AS,7)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// PMD1<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x79F0);	// @ (0xF3E * 8 + 0)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD1,0)
// ECCP2AS<CCP2AS0>
extern volatile __bit                   CCP2AS0             __at(0x7B24);	// @ (0xF64 * 8 + 4)
#define                                 CCP2AS0_bit         _BIT_ACCESS(ECCP2AS,4)
// ECCP2AS<CCP2AS1>
extern volatile __bit                   CCP2AS1             __at(0x7B25);	// @ (0xF64 * 8 + 5)
#define                                 CCP2AS1_bit         _BIT_ACCESS(ECCP2AS,5)
// ECCP2AS<CCP2AS2>
extern volatile __bit                   CCP2AS2             __at(0x7B26);	// @ (0xF64 * 8 + 6)
#define                                 CCP2AS2_bit         _BIT_ACCESS(ECCP2AS,6)
// ECCP2AS<CCP2ASE>
extern volatile __bit                   CCP2ASE             __at(0x7B27);	// @ (0xF64 * 8 + 7)
#define                                 CCP2ASE_bit         _BIT_ACCESS(ECCP2AS,7)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// IPR2<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7B30);	// @ (0xF66 * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// PMD1<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x79F1);	// @ (0xF3E * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD1,1)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// ECCP3AS<CCP3AS0>
extern volatile __bit                   CCP3AS0             __at(0x7ADC);	// @ (0xF5B * 8 + 4)
#define                                 CCP3AS0_bit         _BIT_ACCESS(ECCP3AS,4)
// ECCP3AS<CCP3AS1>
extern volatile __bit                   CCP3AS1             __at(0x7ADD);	// @ (0xF5B * 8 + 5)
#define                                 CCP3AS1_bit         _BIT_ACCESS(ECCP3AS,5)
// ECCP3AS<CCP3AS2>
extern volatile __bit                   CCP3AS2             __at(0x7ADE);	// @ (0xF5B * 8 + 6)
#define                                 CCP3AS2_bit         _BIT_ACCESS(ECCP3AS,6)
// ECCP3AS<CCP3ASE>
extern volatile __bit                   CCP3ASE             __at(0x7ADF);	// @ (0xF5B * 8 + 7)
#define                                 CCP3ASE_bit         _BIT_ACCESS(ECCP3AS,7)
// PIE4<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x7BD0);	// @ (0xF7A * 8 + 0)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x7BD8);	// @ (0xF7B * 8 + 0)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 CCP3IP_bit          _BIT_ACCESS(IPR4,0)
// CCP3CON<CCP3M0>
extern volatile __bit                   CCP3M0              __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 CCP3M0_bit          _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3M1>
extern volatile __bit                   CCP3M1              __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 CCP3M1_bit          _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3M2>
extern volatile __bit                   CCP3M2              __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 CCP3M2_bit          _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3M3>
extern volatile __bit                   CCP3M3              __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 CCP3M3_bit          _BIT_ACCESS(CCP3CON,3)
// PMD1<CCP3MD>
extern volatile __bit                   CCP3MD              __at(0x79F2);	// @ (0xF3E * 8 + 2)
#define                                 CCP3MD_bit          _BIT_ACCESS(PMD1,2)
// PORTD<CCP4>
extern volatile __bit                   CCP4                __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 CCP4_bit            _BIT_ACCESS(PORTD,1)
// PIE4<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x7BD1);	// @ (0xF7A * 8 + 1)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x7BD9);	// @ (0xF7B * 8 + 1)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR4,1)
// IPR4<CCP4IP>
extern volatile __bit                   CCP4IP              __at(0x7BE1);	// @ (0xF7C * 8 + 1)
#define                                 CCP4IP_bit          _BIT_ACCESS(IPR4,1)
// CCP4CON<CCP4M0>
extern volatile __bit                   CCP4M0              __at(0x7AB8);	// @ (0xF57 * 8 + 0)
#define                                 CCP4M0_bit          _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4M1>
extern volatile __bit                   CCP4M1              __at(0x7AB9);	// @ (0xF57 * 8 + 1)
#define                                 CCP4M1_bit          _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4M2>
extern volatile __bit                   CCP4M2              __at(0x7ABA);	// @ (0xF57 * 8 + 2)
#define                                 CCP4M2_bit          _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4M3>
extern volatile __bit                   CCP4M3              __at(0x7ABB);	// @ (0xF57 * 8 + 3)
#define                                 CCP4M3_bit          _BIT_ACCESS(CCP4CON,3)
// PMD1<CCP4MD>
extern volatile __bit                   CCP4MD              __at(0x79F3);	// @ (0xF3E * 8 + 3)
#define                                 CCP4MD_bit          _BIT_ACCESS(PMD1,3)
// PORTE<CCP5>
extern volatile __bit                   CCP5                __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CCP5_bit            _BIT_ACCESS(PORTE,2)
// PIE4<CCP5IE>
extern volatile __bit                   CCP5IE              __at(0x7BD2);	// @ (0xF7A * 8 + 2)
#define                                 CCP5IE_bit          _BIT_ACCESS(PIE4,2)
// PIR4<CCP5IF>
extern volatile __bit                   CCP5IF              __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 CCP5IF_bit          _BIT_ACCESS(PIR4,2)
// IPR4<CCP5IP>
extern volatile __bit                   CCP5IP              __at(0x7BE2);	// @ (0xF7C * 8 + 2)
#define                                 CCP5IP_bit          _BIT_ACCESS(IPR4,2)
// CCP5CON<CCP5M0>
extern volatile __bit                   CCP5M0              __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 CCP5M0_bit          _BIT_ACCESS(CCP5CON,0)
// CCP5CON<CCP5M1>
extern volatile __bit                   CCP5M1              __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 CCP5M1_bit          _BIT_ACCESS(CCP5CON,1)
// CCP5CON<CCP5M2>
extern volatile __bit                   CCP5M2              __at(0x7AA2);	// @ (0xF54 * 8 + 2)
#define                                 CCP5M2_bit          _BIT_ACCESS(CCP5CON,2)
// CCP5CON<CCP5M3>
extern volatile __bit                   CCP5M3              __at(0x7AA3);	// @ (0xF54 * 8 + 3)
#define                                 CCP5M3_bit          _BIT_ACCESS(CCP5CON,3)
// PMD1<CCP5MD>
extern volatile __bit                   CCP5MD              __at(0x79F4);	// @ (0xF3E * 8 + 4)
#define                                 CCP5MD_bit          _BIT_ACCESS(PMD1,4)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// EECON1<CFGS>
extern volatile __bit                   CFGS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x7E16);	// @ (0xFC2 * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// PORTC<CK>
extern volatile __bit                   CK                  __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK_bit              _BIT_ACCESS(PORTC,6)
// PORTC<CK1>
extern volatile __bit                   CK1                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK1_bit             _BIT_ACCESS(PORTC,6)
// PORTD<CK2>
extern volatile __bit                   CK2                 __at(0x7C1E);	// @ (0xF83 * 8 + 6)
